#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_s3_bucket.terraform_state,
  on backend.tf line 1, in resource "aws_s3_bucket" "terraform_state":
   1: resource "aws_s3_bucket" "terraform_state" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.ecs_assume_role_policy: Reading...
aws_iam_openid_connect_provider.github_oidc: Refreshing state... [id=arn:aws:iam::040546586270:oidc-provider/token.actions.githubusercontent.com]
aws_vpc.owasp: Refreshing state... [id=vpc-0dc3b41e0a7c738e0]
aws_s3_bucket.terraform_state: Refreshing state... [id=terraform-state-8c256417-1822-44df-afbd-613c7097c0e9]
data.aws_caller_identity.current: Reading...
aws_ecr_registry_scanning_configuration.test: Refreshing state... [id=040546586270]
aws_eip.owasp: Refreshing state... [id=eipalloc-06c9b4855363e0d62]
aws_ecr_repository.owasp: Refreshing state... [id=owasp]
aws_cloudwatch_log_group.owasp: Refreshing state... [id=/ecs/owasp]
aws_kms_key.owasp: Refreshing state... [id=3d89ac7c-efe0-401d-9ce6-e74201d5bf5f]
data.aws_iam_policy_document.ecs_assume_role_policy: Read complete after 0s [id=1077804475]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-lock-8c256417-1822-44df-afbd-613c7097c0e9]
data.aws_caller_identity.current: Read complete after 0s [id=040546586270]
aws_iam_role.ecs: Refreshing state... [id=ecsTaskExecutionRole]
aws_inspector2_enabler.ecr: Refreshing state... [id=040546586270-ECR]
data.aws_iam_policy_document.github_allow: Reading...
data.aws_iam_policy_document.github_allow: Read complete after 0s [id=1652893663]
aws_iam_role.github_role: Refreshing state... [id=GitHubActionsRole]
aws_ecr_lifecycle_policy.owasp: Refreshing state... [id=owasp]
aws_ecs_cluster.owasp: Refreshing state... [id=arn:aws:ecs:us-east-1:040546586270:cluster/owasp]
aws_ecs_task_definition.owasp: Refreshing state... [id=owasp]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=terraform-state-8c256417-1822-44df-afbd-613c7097c0e9]
aws_internet_gateway.owasp: Refreshing state... [id=igw-0811ef39066ddd2ee]
aws_subnet.private_b: Refreshing state... [id=subnet-02a09b5c295589a88]
aws_security_group.lb: Refreshing state... [id=sg-0300ea0464d53a22a]
aws_subnet.public_a: Refreshing state... [id=subnet-0466c94e7a3faa3ad]
aws_subnet.public_b: Refreshing state... [id=subnet-0b077bec75551a7df]
aws_subnet.private_a: Refreshing state... [id=subnet-0fa684024474b90e5]
aws_lb_target_group.owasp: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:040546586270:targetgroup/tg-owasp-lb-ip/525814a9dc5ebd25]
aws_route_table.public: Refreshing state... [id=rtb-0a1415f013b72d653]
aws_security_group.ecs: Refreshing state... [id=sg-06b986277d752fa6d]
aws_nat_gateway.owasp: Refreshing state... [id=nat-0498602bf56f20995]
aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-06a4438b64152d0fb]
aws_route_table_association.public_b: Refreshing state... [id=rtbassoc-07ba9664a704a259b]
aws_lb.owasp: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:040546586270:loadbalancer/app/owasp-lb/c2277824d10914d2]
aws_route_table.private: Refreshing state... [id=rtb-080d49b48daf000d8]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-06d5df8a1bbe61f41]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-02bbe83192c614e7d]
aws_ecs_service.owasp: Refreshing state... [id=arn:aws:ecs:us-east-1:040546586270:service/owasp/owasp-js]
aws_lb_listener.owasp: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:040546586270:listener/app/owasp-lb/c2277824d10914d2/5e6626f98e21db09]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.owasp will be updated in-place
  ~ resource "aws_ecs_service" "owasp" {
        id                                 = "arn:aws:ecs:us-east-1:040546586270:service/owasp/owasp-js"
        name                               = "owasp-js"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:040546586270:task-definition/owasp:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.owasp must be replaced
-/+ resource "aws_ecs_task_definition" "owasp" {
      ~ arn                      = "arn:aws:ecs:us-east-1:040546586270:task-definition/owasp:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:040546586270:task-definition/owasp" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - environment      = []
                  ~ image            = "018857050180.dkr.ecr.us-east-1.amazonaws.com/owasp:latest" -> "040546586270.dkr.ecr.us-east-1.amazonaws.com/owasp:1.0"
                  - mountPoints      = []
                    name             = "owasp-js"
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "owasp" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-080d49b48daf000d8"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0498602bf56f20995"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0498602bf56f20995"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "OWASP | Private Route Table"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "key" but a value was found
in file "tfvars/backend.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "workspace_key_prefix" but
a value was found in file "tfvars/backend.tfvars". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Argument is deprecated

  with aws_s3_bucket.terraform_state,
  on backend.tf line 1, in resource "aws_s3_bucket" "terraform_state":
   1: resource "aws_s3_bucket" "terraform_state" {

Use the aws_s3_bucket_versioning resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @gregsienkiewicz, Action: `pull_request`, Workflow: `Terraform Plan`*